Tekla Open API Reference for Tekla Structures 2025
StringList.Add Method
 Adds a new string to the end of the string list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int Add(
	string value
)
Public Function Add (
	value As String
) As Integer
Parameters
value
Type: System.String
The string to be added to the list.
Return Value
Type: Int32
The index where the string was added.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace